# PrevObj

## Description
Function PrevObj returns the object in any list which precedes the specified object.  If the end of the list is reached, the function returns NIL.

```pascal
FUNCTION PrevObj(h : HANDLE): HANDLE;
```

```python
def vs.PrevObj(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object,  group, or  symbol definition.|

## See Also
Relative calls:
* NextObj | PrevObj
* FObject | LObject
* FSActLayer | LSActLayer
* FSObject  | LActLayer
* NextDObj | PrevDObj
* NextSObj | PrevSObj

## Version
Availability: from All Versions

## Category
* Document List Handling